## pandas basics exercise

In [2]:
## 1) import pandas under the alias pd

import pandas as pd
import numpy as np

In [50]:
# 2) Print the version of the pandas that has been imported 

print(pd.__version__)

1.5.3

In [5]:
## 3) try checking with the help of any of thr function in pandas
list1=[90,60,50,65]

pd.Series(data=list1)

0    90
1    60
2    50
3    65
dtype: int64

In [6]:
# 4) aggregating data in dataframes 

df=pd.DataFrame({'labels':['a','b','c','d','e','f','g','h','i','j'],
    'animals':['cat','cat','snake','dog','dog','cat','snake','cat','dog','dog'],
       'age':[2.5,3,0.5,'np.nan',5,2,4.5,'np.nan',7,2],
       'visits':[1,3,2,3,2,3,1,1,2,1],
    'priority':['yes','yes','no','yes','no','no','no','yes','no','no']})
df.set_index("labels",inplace=True)
df

       animals     age  visits priority
labels
a          cat     2.5       1      yes
b          cat       3       3      yes
c        snake     0.5       2       no
d          dog  np.nan       3      yes
e          dog       5       2       no
f          cat       2       3       no
g        snake     4.5       1       no
h          cat  np.nan       1      yes
i          dog       7       2       no
j          dog       2       1       no

In [7]:
df.index

Index(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j'], dtype='object', name='labels')

In [8]:
## 5) Dispaly the summary of basic informaton
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   animals   10 non-null     object
 1   age       10 non-null     object
 2   visits    10 non-null     int64
 3   priority  10 non-null     object
dtypes: int64(1), object(3)
memory usage: 400.0+ bytes

In [9]:
## 6)Return the three rows of DataFrame df

In [10]:
## 7) select just animals and age columnn from df
df.iloc[:,:2]

       animals     age
labels
a          cat     2.5
b          cat       3
c        snake     0.5
d          dog  np.nan
e          dog       5
f          cat       2
g        snake     4.5
h          cat  np.nan
i          dog       7
j          dog       2

In [11]:
#### 8) select the datta in rows [3,4,8] and in column [animals,age ]

df.loc['d']

animals        dog
age         np.nan
visits           3
priority       yes
Name: d, dtype: object

In [12]:
df.loc['e']

animals     dog
age           5
visits        2
priority     no
Name: e, dtype: object

In [13]:
df.loc['i']

animals     dog
age           7
visits        2
priority     no
Name: i, dtype: object

In [14]:
## 9)select the rows where the no. of visits is greater than 3
df[df.visits>3]

Empty DataFrame
Columns: [animals, age, visits, priority]
Index: []

In [15]:
## 10) check for the the missing values
df.isna().sum()

animals     0
age         0
visits      0
priority    0
dtype: int64

In [16]:
### 11) select the rows where animal is a cat and the age is less than 3
# Convert the 'age' column to numeric, treating non-numeric values as NaN
df['age'] = pd.to_numeric(df['age'], errors='coerce')

# Now, you can filter rows where 'animal' is 'cat' and 'age' is less than 3
cat_and_young = df[(df['animals'] == 'cat') & (df['age'] < 3)]

# Print the selected rows
print(cat_and_young)

       animals  age  visits priority
labels
a          cat  2.5       1      yes
f          cat  2.0       3       no

In [17]:
## 12) select the rows the age is between 2 and 4 (inclusive)

# Convert the 'age' column to numeric, treating non-numeric values as NaN
df['age'] = pd.to_numeric(df['age'], errors='coerce')

# Select rows where 'age' is between 2 and 4 (inclusive)
selected_rows = df[(df['age'] >= 2) & (df['age'] <= 4)]

# Print the selected rows
print(selected_rows)

       animals  age  visits priority
labels
a          cat  2.5       1      yes
b          cat  3.0       3      yes
f          cat  2.0       3       no
j          dog  2.0       1       no

In [18]:
## 13) change the age in row f to 1.5 
## The at method in pandas stands for "accessor to access a single value for a row/column label pair." It allows you to directly access and modify a single element in a DataFrame using row and column labels.
df.at['f', 'age'] = 1.5
df

       animals  age  visits priority
labels
a          cat  2.5       1      yes
b          cat  3.0       3      yes
c        snake  0.5       2       no
d          dog  NaN       3      yes
e          dog  5.0       2       no
f          cat  1.5       3       no
g        snake  4.5       1       no
h          cat  NaN       1      yes
i          dog  7.0       2       no
j          dog  2.0       1       no

In [19]:
## 14)  calculte the sum of all visits in df( find the total no. of visits)
total_visits = df['visits'].sum()
total_visits

19

In [20]:
## 15) calculate the mean age for each differnt animal in df. Explore the group by function

# Calculate the mean age for each different animal using groupby
mean_age_by_animal = df.groupby('animals')['age'].mean()

# Print the mean age for each different animal
print(mean_age_by_animal)

animals
cat      2.333333
dog      4.666667
snake    2.500000
Name: age, dtype: float64

In [21]:
 ## 16) append a new row 'k' to 'df' with yourr choice of value for each column. Then delete the row to return the original DataFrame
    # Append a new row 'k' with your choice of values using df.append()
new_data = {'animals': 'rabbit', 'age': 1.5, 'visits': 4, 'priority': 'yes'}
df1 = df.append(pd.DataFrame(new_data, index=['k']))

df1

C:\Users\Roshan\AppData\Local\Temp\ipykernel_11404\886866676.py:4: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df1 = df.append(pd.DataFrame(new_data, index=['k']))

  animals  age  visits priority
a     cat  2.5       1      yes
b     cat  3.0       3      yes
c   snake  0.5       2       no
d     dog  NaN       3      yes
e     dog  5.0       2       no
f     cat  1.5       3       no
g   snake  4.5       1       no
h     cat  NaN       1      yes
i     dog  7.0       2       no
j     dog  2.0       1       no
k  rabbit  1.5       4      yes

In [23]:
# Drop the newly added row 'k' to return the original DataFrame
df = df1.drop('k')
df

  animals  age  visits priority
a     cat  2.5       1      yes
b     cat  3.0       3      yes
c   snake  0.5       2       no
d     dog  NaN       3      yes
e     dog  5.0       2       no
f     cat  1.5       3       no
g   snake  4.5       1       no
h     cat  NaN       1      yes
i     dog  7.0       2       no
j     dog  2.0       1       no

In [28]:
## 17) count the number of each type of animal in 'df'
animal_counts = df['animals'].value_counts()
print(animal_counts)

cat      4
dog      4
snake    2
Name: animals, dtype: int64

In [42]:
## 18)sort df first by the value in the 'age' indescending order then by the value in the 'visit' column in ascending order (so row 'i' should be first and 'd' should be last)
df = df.sort_values(by=['age', 'visits'], ascending=[False, True])
df

  animals  age  visits  priority
i     dog  7.0       2     False
e     dog  5.0       2     False
g   snake  4.5       1     False
b     cat  3.0       3      True
a     cat  2.5       1      True
j     dog  2.0       1     False
f     cat  1.5       3     False
c   snake  0.5       2     False
h     cat  NaN       1      True
d     dog  NaN       3      True

In [29]:
## 19) the 'priority' column contains the value 'yes' and 'no'. replace this column with a column of boolean values 'yes' should be true an d'no  should be false
# Replace 'priority' column with boolean values
df['priority'] = df['priority'].replace({'yes': True, 'no': False})


print(df)

  animals  age  visits  priority
a     cat  2.5       1      True
b     cat  3.0       3      True
c   snake  0.5       2     False
d     dog  NaN       3      True
e     dog  5.0       2     False
f     cat  1.5       3     False
g   snake  4.5       1     False
h     cat  NaN       1      True
i     dog  7.0       2     False
j     dog  2.0       1     False

In [49]:
## 20) in the animal column change the 'snake' entries to python
df1 = df['animals'].replace('snake', 'python')
df1

i       dog
e       dog
g    python
b       cat
a       cat
j       dog
f       cat
c    python
h       cat
d       dog
Name: animals, dtype: object